# -*- coding: utf-8 -*-
# @File Name:     examples.py
# @Author :       Jun
# @Date:          2024/12/21
# @Description :

examples = {
    "1.1 模型与结果问答 - 预测误差": """\
当前OD预测模型的预测误差是多少？""",

    "1.2 模型与结果问答 - 流量变化": """\
哪几个区域的出行流量变化最大？""",

    "1.3 模型与结果问答 - 春运预测": """\
预测一下2025年春运期间京津冀都市圈内的OD，出行峰值分别是多少?对应哪几天？""",

    "1.4 模型与结果问答 - 热门通道": """\
2025年春运期间全国热门出行省份通道（出发省-到达省）top10是哪些？这些省份中出行量最高的城市有哪些？""",

    "2.1 数据与特征解释 - OD矩阵": """\
OD矩阵是如何生成的？""",

    "2.2 数据与特征解释 - 空间关系": """\
模型考虑了哪些空间关系？""",

    "3.1 分析与决策支持 - 流量变化": """\
假设节假日流量提升20%，模型预测会怎样变化？""",

    "3.2 分析与决策支持 - 拥堵预测": """\
在出行高峰期哪些OD对最容易拥堵？"""

}